# Brewfile
# -----------------------------------------------------------------------------

# tap
# -----------------------------------------------------------------------------


# -----------------------------------------------------------------------------
brew "tmux"
brew "mise"
brew "ghq"
brew "wget"
brew "freetype"
brew "fzf"
brew "pt"                                   # the platinum searcher
brew "sheldon"
brew "tig"
brew "xh"
brew "zsh"
brew "gh"
brew "lazygit"
brew "yazi"
brew "pandoc"

# cask
# -----------------------------------------------------------------------------
cask "font-jetbrains-mono"
cask "codex"
