# Brewfile
# -----------------------------------------------------------------------------

# tap
# -----------------------------------------------------------------------------
tap "coursier/formulas"
tap "homebrew/bundle"
tap "homebrew/services"

#
# -----------------------------------------------------------------------------
brew "mise"
brew "freetype"
brew "ghq"
brew "fzf"
brew "pt"                                   # the platinum searcher
brew "sheldon"
brew "tig"
brew "vim"
brew "wget"
brew "xh"
brew "zsh"
cask "font-jetbrains-mono"
brew "gh"

# yabai + skhd (tiling window manager)
# -----------------------------------------------------------------------------
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
