# tap
# -----------------------------------------------------------------------------
tap 'homebrew/cask'
tap "homebrew/cask-fonts"

# cask - mac application.
# -----------------------------------------------------------------------------
cask "macfuse"
cask "raycast"
cask "xquartz"
cask 'android-studio'
cask 'appcleaner'
cask 'arduino'
cask 'dropbox'
cask 'evernote'
cask 'font-fira-code'
cask 'google-chrome'
cask 'macfuse'
cask 'slack'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'xquartz'

# mas - mac app store application.
# -----------------------------------------------------------------------------
mas "Bitwarden", id: 1352778147
mas "Display Menu", id: 549083868
mas "LINE", id: 539883307
mas "UpNote", id: 1398373917
mas "Vimari", id: 1480933944
