# -----------------------------------------------------------------------------
# Brewfile
# -----------------------------------------------------------------------------

# tap
# -----------------------------------------------------------------------------
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/binary'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/fuse'
# for QMKFirmware
tap 'osx-cross/avr'
tap 'PX4/homebrew-px4'

# cask
# -----------------------------------------------------------------------------
cask 'alfred'
cask 'appcleaner'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'java'             # java10
cask 'java8'            # java8
cask 'google-chrome'
cask 'osxfuse'
cask 'xquartz'
cask 'slack'
cask 'the-unarchiver'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'skype'
cask 'vlc'
cask 'android-studio'

# ethers
# -----------------------------------------------------------------------------
brew 'awscli'
brew 'cdrtools'
brew 'composer'
brew 'coreutils'
brew 'ctags'
brew 'freetype'
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'glib'
brew 'go'
brew 'jq'
brew 'macvim'
brew 'mecab'
brew 'mecab-ipadic'
brew 'mobile-shell'
brew 'nodebrew'
brew 'openssl'
brew 'p7zip'
brew 'peco'
brew 'php70'
brew 'pkg-config'
brew 'protobuf'
brew 'python'
brew 'python3'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'sbt'
brew 'scala'
brew 'sshfs'
brew 'the_platinum_searcher'
brew 'tmux'
brew 'unixodbc'
brew 'wget'
brew 'xz'
brew 'zlib'
brew 'zsh', args: ['enable-etcdir']
brew 'vim', args: ['with-override-system-vi']
brew 'mysql@5.7'
brew 'memcached'
brew 'tig'

# for QMKFirmware
brew 'avr-gcc@7'
brew 'dfu-programmer'
brew 'dfu-util'
brew 'gcc-arm-none-eabi'
brew 'avrdude'


