tap 'caskroom/homebrew-cask'
tap 'caskroom/fonts'
tap 'homebrew/binary'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'peco/peco'

brew 'autoconf'
brew 'automake'
brew 'boot2docker'
brew 'cdrtools'
brew 'coreutils'
brew 'cscope'
brew 'docker'
brew 'freetype'
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'glib'
brew 'go'
brew 'icu4c'
brew 'jpeg'
brew 'jq'
brew 'libevent'
brew 'libffi'
brew 'libpng'
brew 'libtool'
brew 'libmemcached'
brew 'libyaml'
brew 'macvim'
brew 'mcrypt'
brew 'memcached'
brew 'mhash'
brew 'mobile-shell'
brew 'mysql'
brew 'openssl'
brew 'p7zip'
brew 'pcre'
brew 'peco'
brew 'pkg-config'
brew 'protobuf'
brew 'smake'
brew 'sshfs'
brew 'terminal-notifier'
brew 'tmux'
brew 'unixodbc'
brew 'wget'
brew 'zlib'
brew 'pt'
brew 'zsh', args: ['enable-etcdir']


brew 'brew-cask'
cask 'alfred'
cask 'appcleaner'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'google-drive'
cask 'osxfuse'
cask 'sourcetree'
cask 'sublime-text'
cask 'vagrant'
cask 'virtualbox'
cask 'xquartz'
cask 'atom'
cask 'slack'
cask 'the-unarchiver'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'skype'

brew 'php56'
brew 'php56-apcu'
brew 'php56-mcrypt'
brew 'php56-memcached'
brew 'php56-igbinary'
brew 'php56-intl'
brew 'php56-opcache'
brew 'composer'

brew 'mecab'
brew 'mecab-ipadic'

cask 'java'
brew 'scala'
brew 'sbt'

brew 'node'
