# -----------------------------------------------------------------------------
# Brewfile
# -----------------------------------------------------------------------------

# tap
# -----------------------------------------------------------------------------
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/binary'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/fuse'
tap 'peco/peco'

# cask
# -----------------------------------------------------------------------------
cask 'atom'
cask 'alfred'
cask 'appcleaner'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'java'
cask 'google-chrome'
cask 'google-drive'
cask 'osxfuse'
cask 'xquartz'
cask 'slack'
cask 'the-unarchiver'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'skype'
cask 'virtualbox'
cask 'vagrant'
cask 'vlc'
cask 'mysqlworkbench'

# ethers
# -----------------------------------------------------------------------------
brew 'awscli'
brew 'cdrtools'
brew 'composer'
brew 'coreutils'
brew 'ctags'
brew 'freetype'
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'glib'
brew 'go'
brew 'jq'
brew 'macvim'
brew 'mecab'
brew 'mecab-ipadic'
brew 'mobile-shell'
brew 'node'
brew 'openssl'
brew 'p7zip'
brew 'peco'
brew 'php70'
brew 'php70-apcu'
brew 'php70-intl'
brew 'php70-mcrypt'
brew 'php70-memcached'
brew 'php70-opcache'
brew 'pkg-config'
brew 'protobuf'
brew 'python'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'sbt'
brew 'scala'
brew 'sshfs'
brew 'terminal-notifier'
brew 'the_platinum_searcher'
brew 'tmux'
brew 'unixodbc'
brew 'wget'
brew 'xz'
brew 'zlib'
brew 'zsh', args: ['enable-etcdir']

